In [1]:
#pandas数据分析
import pandas as pd

In [3]:
pd.Series([2,3,4,5])

0    2
1    3
2    4
3    5
dtype: int64

In [5]:
pd.Series([2,3,4,5],index=['a','b','c','d'])#字典和列表的结合体

a    2
b    3
c    4
d    5
dtype: int64

In [6]:
import numpy as np

In [7]:
pd.Series(np.arange(5))

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [8]:
sr = pd.Series([2,3,4,5],index=['a','b','c','d'])

In [9]:
sr

a    2
b    3
c    4
d    5
dtype: int64

In [10]:
sr[0]

2

In [11]:
sr+sr

a     4
b     6
c     8
d    10
dtype: int64

In [12]:
sr[0:2]

a    2
b    3
dtype: int64

In [13]:
sr[sr>4]

d    5
dtype: int64

In [14]:
sr = pd.Series({'a':1,'b':2})

In [15]:
sr

a    1
b    2
dtype: int64

In [16]:
sr['a']

1

In [17]:
'a'in sr

True

In [18]:
'c' in sr

False

In [19]:
sr

a    1
b    2
dtype: int64

In [20]:
for i in sr:
    print(i)#更关注她的值而不是索引

1
2

In [21]:
sr.index

Index(['a', 'b'], dtype='object')

In [22]:
sr.index[0]

'a'

In [23]:
sr.values

array([1, 2], dtype=int64)

In [26]:
sr = pd.Series([1,2,3,4],index=['a','b','c','d'])

In [27]:
sr

a    1
b    2
c    3
d    4
dtype: int64

In [28]:
sr[['a','c']]

a    1
c    3
dtype: int64

In [29]:
sr['a':'c']

a    1
b    2
c    3
dtype: int64

In [30]:
sr = pd.Series(np.arange(20))

In [31]:
sr

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
dtype: int32

In [32]:
sr2 = sr[10:].copy()

In [33]:
sr2

10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
dtype: int32

In [34]:
sr2[10]

10

In [35]:
sr2[-1]

KeyError: -1

In [36]:
sr2

10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
dtype: int32

In [37]:
sr2.loc[10]

10

In [38]:
sr2.iloc[10]

IndexError: single positional indexer is out-of-bounds

In [39]:
sr2

10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
dtype: int32

In [40]:
sr2.iloc[9]

19

In [41]:
sr2.iloc[1]

11

In [42]:
sr1 = pd.Series([12,23,34],index=['c','a','d'])
sr2 = pd.Series([11,20,10],index=['d','c','a'])

In [43]:
sr1+sr2#a:23+10

a    33
c    32
d    45
dtype: int64

In [44]:
sr1 = pd.Series([12,23,34],index=['c','a','d'])
sr2 = pd.Series([11,20,10,21],index=['d','c','a','b'])

In [45]:
sr1+sr2#b是数据缺失值

a    33.0
b     NaN
c    32.0
d    45.0
dtype: float64

In [46]:
sr1.add(sr2)

a    33.0
b     NaN
c    32.0
d    45.0
dtype: float64

In [47]:
sr1.add(sr2,fill_value=0)#出现缺失数据 就处理掉

a    33.0
b    21.0
c    32.0
d    45.0
dtype: float64

In [48]:
#删掉缺失数据
sr.isnull()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
dtype: bool

In [49]:
sr[sr.notnull()]

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
dtype: int32

In [50]:
sr.dropna()

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
dtype: int32

In [51]:
sr.fillna(0)

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
dtype: int32

In [52]:
sr.fillna(sr.mean())

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
dtype: int32

In [53]:
sr

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
dtype: int32

In [54]:
sr.mean()

9.5

In [55]:
#series
    #数组+字典
    #整数索引loc和iloc
    #数据对齐 nan 
    #缺失数据处理 dropna fillna

In [56]:
pd.DataFrame({'one':[1,2,3],'two':[4,5,6]})

   one  two
0    1    4
1    2    5
2    3    6

In [57]:
pd.DataFrame({'one':[1,2,3],'two':[4,5,6]},index={'a','b','c'})

   one  two
b    1    4
a    2    5
c    3    6

In [72]:
pd.DataFrame({'one':pd.Series([1,2,3],index=['a','b','c']),'two':pd.Series([1,2,3,4],index=['b','a','c','d'])})

   one  two
a  1.0    2
b  2.0    1
c  3.0    3
d  NaN    4

In [87]:
df=pd.DataFrame({'one':pd.Series([1,2,3],index=['a','b','c']),'two':pd.Series([1,2,3,4],index=['b','a','c','d'])})

In [88]:
df

   one  two
a  1.0    2
b  2.0    1
c  3.0    3
d  NaN    4

In [89]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [90]:
df.values

array([[ 1.,  2.],
       [ 2.,  1.],
       [ 3.,  3.],
       [nan,  4.]])

In [91]:
df

   one  two
a  1.0    2
b  2.0    1
c  3.0    3
d  NaN    4

In [92]:
df.T

       a    b    c    d
one  1.0  2.0  3.0  NaN
two  2.0  1.0  3.0  4.0

In [93]:
df

   one  two
a  1.0    2
b  2.0    1
c  3.0    3
d  NaN    4

In [94]:
df.columns

Index(['one', 'two'], dtype='object')

In [95]:
df.describe()

       one       two
count  3.0  4.000000
mean   2.0  2.500000
std    1.0  1.290994
min    1.0  1.000000
25%    1.5  1.750000
50%    2.0  2.500000
75%    2.5  3.250000
max    3.0  4.000000

In [96]:
df

   one  two
a  1.0    2
b  2.0    1
c  3.0    3
d  NaN    4

In [97]:
#DataFrame
    #index 行索引
    #colums 列索引
    #values 值（二维数组）
    #T 转置
    #describe()描述统计信息

In [98]:
df['one']['a']

1.0

In [99]:
df.loc['a','one']#行，列

1.0

In [100]:
df

   one  two
a  1.0    2
b  2.0    1
c  3.0    3
d  NaN    4

In [102]:
df.loc['a',:]

one    1.0
two    2.0
Name: a, dtype: float64

In [103]:
df.loc[['a','c'],'two']

a    2
c    3
Name: two, dtype: int64

In [104]:
df.loc[['a','c'],:]

   one  two
a  1.0    2
c  3.0    3

In [105]:
df=pd.DataFrame({'two':[1,2,3,4],'one':[4,5,6,7]},index=['c','d','b','a'])

In [108]:
df

   two  one
c    1    4
d    2    5
b    3    6
a    4    7

In [111]:
df2 = _73

NameError: name '_73' is not defined

In [112]:
df2 = df

In [113]:
df2

   two  one
c    1    4
d    2    5
b    3    6
a    4    7

In [114]:
df+df2

   two  one
c    2    8
d    4   10
b    6   12
a    8   14

In [115]:
df2

   two  one
c    1    4
d    2    5
b    3    6
a    4    7

In [116]:
df2.fillna(0)

   two  one
c    1    4
d    2    5
b    3    6
a    4    7

In [117]:
df2.dropna()

   two  one
c    1    4
d    2    5
b    3    6
a    4    7

In [118]:
df2.loc['d','two']=np.nan

In [119]:
import numpy as np

In [121]:
df2.loc['c','two']=np.nan

In [122]:
df2

   two  one
c  NaN    4
d  NaN    5
b  3.0    6
a  4.0    7

In [123]:
df2.dropna()

   two  one
b  3.0    6
a  4.0    7

In [124]:
df2.dropna(how='all')

   two  one
c  NaN    4
d  NaN    5
b  3.0    6
a  4.0    7

In [125]:
df2.dropna(how='any')

   two  one
b  3.0    6
a  4.0    7

In [126]:
df2

   two  one
c  NaN    4
d  NaN    5
b  3.0    6
a  4.0    7

In [128]:
df.loc['c','one']=np.nan

In [129]:
df

   two  one
c  NaN  NaN
d  NaN  5.0
b  3.0  6.0
a  4.0  7.0

In [130]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [c, d, b, a]

In [131]:
df

   two  one
c  NaN  NaN
d  NaN  5.0
b  3.0  6.0
a  4.0  7.0

In [132]:
df.mean()

two    3.5
one    6.0
dtype: float64

In [133]:
df.mean(axis=1)

c    NaN
d    5.0
b    4.5
a    5.5
dtype: float64

In [134]:
df.sum()

two     7.0
one    18.0
dtype: float64

In [135]:
df.sum(axis=1)

c     0.0
d     5.0
b     9.0
a    11.0
dtype: float64

In [136]:
df

   two  one
c  NaN  NaN
d  NaN  5.0
b  3.0  6.0
a  4.0  7.0

In [137]:
df.sort_values(by='two')

   two  one
b  3.0  6.0
a  4.0  7.0
c  NaN  NaN
d  NaN  5.0

In [138]:
df.sort_values(by='two',ascending=False)

   two  one
a  4.0  7.0
b  3.0  6.0
c  NaN  NaN
d  NaN  5.0

In [140]:
df.sort_values(by='a',ascending=False,axis=1)

   one  two
c  NaN  NaN
d  5.0  NaN
b  6.0  3.0
a  7.0  4.0

In [141]:
df

   two  one
c  NaN  NaN
d  NaN  5.0
b  3.0  6.0
a  4.0  7.0

In [142]:
df.sort_values(by='one')

   two  one
d  NaN  5.0
b  3.0  6.0
a  4.0  7.0
c  NaN  NaN

In [143]:
df.sort_values(by='two',ascending=False)

   two  one
a  4.0  7.0
b  3.0  6.0
c  NaN  NaN
d  NaN  5.0

In [144]:
df.sort_index()

   two  one
a  4.0  7.0
b  3.0  6.0
c  NaN  NaN
d  NaN  5.0

In [145]:
df.sort_index(ascending=False)

   two  one
d  NaN  5.0
c  NaN  NaN
b  3.0  6.0
a  4.0  7.0

In [146]:
df.sort_index(ascending=False,axis=1)

   two  one
c  NaN  NaN
d  NaN  5.0
b  3.0  6.0
a  4.0  7.0

In [147]:
#时间序列
import datetime

In [148]:
datetime.datetime.strptime('2010-01-01','%Y-%m-%d')

datetime.datetime(2010, 1, 1, 0, 0)

In [149]:
import dateutil

In [150]:
dateutil.parser.parse('2001-01-01')

datetime.datetime(2001, 1, 1, 0, 0)

In [151]:
dateutil.parser.parse('02/03/2001')

datetime.datetime(2001, 2, 3, 0, 0)

In [152]:
dateutil.parser.parse('2001-JAN-01')

datetime.datetime(2001, 1, 1, 0, 0)

In [153]:
pd.to_datetime(['2001-01-01','2010/Feb/02'])

DatetimeIndex(['2001-01-01', '2010-02-02'], dtype='datetime64[ns]', freq=None)

In [154]:
pd.date_range?

In [157]:
pd.date_range('2010-01-01','2010-5-1')

DatetimeIndex(['2010-01-01', '2010-01-02', '2010-01-03', '2010-01-04',
               '2010-01-05', '2010-01-06', '2010-01-07', '2010-01-08',
               '2010-01-09', '2010-01-10',
               ...
               '2010-04-22', '2010-04-23', '2010-04-24', '2010-04-25',
               '2010-04-26', '2010-04-27', '2010-04-28', '2010-04-29',
               '2010-04-30', '2010-05-01'],
              dtype='datetime64[ns]', length=121, freq='D')

In [158]:
pd.date_range('2010-01-01',periods=60)

DatetimeIndex(['2010-01-01', '2010-01-02', '2010-01-03', '2010-01-04',
               '2010-01-05', '2010-01-06', '2010-01-07', '2010-01-08',
               '2010-01-09', '2010-01-10', '2010-01-11', '2010-01-12',
               '2010-01-13', '2010-01-14', '2010-01-15', '2010-01-16',
               '2010-01-17', '2010-01-18', '2010-01-19', '2010-01-20',
               '2010-01-21', '2010-01-22', '2010-01-23', '2010-01-24',
               '2010-01-25', '2010-01-26', '2010-01-27', '2010-01-28',
               '2010-01-29', '2010-01-30', '2010-01-31', '2010-02-01',
               '2010-02-02', '2010-02-03', '2010-02-04', '2010-02-05',
               '2010-02-06', '2010-02-07', '2010-02-08', '2010-02-09',
               '2010-02-10', '2010-02-11', '2010-02-12', '2010-02-13',
               '2010-02-14', '2010-02-15', '2010-02-16', '2010-02-17',
               '2010-02-18', '2010-02-19', '2010-02-20', '2010-02-21',
               '2010-02-22', '2010-02-23', '2010-02-24', '2010-02-25',
               '2010-02-26', '2010-02-27', '2010-02-28', '2010-03-01'],
              dtype='datetime64[ns]', freq='D')

In [159]:
pd.date_range('2010-01-01',periods=60,freq='H')

DatetimeIndex(['2010-01-01 00:00:00', '2010-01-01 01:00:00',
               '2010-01-01 02:00:00', '2010-01-01 03:00:00',
               '2010-01-01 04:00:00', '2010-01-01 05:00:00',
               '2010-01-01 06:00:00', '2010-01-01 07:00:00',
               '2010-01-01 08:00:00', '2010-01-01 09:00:00',
               '2010-01-01 10:00:00', '2010-01-01 11:00:00',
               '2010-01-01 12:00:00', '2010-01-01 13:00:00',
               '2010-01-01 14:00:00', '2010-01-01 15:00:00',
               '2010-01-01 16:00:00', '2010-01-01 17:00:00',
               '2010-01-01 18:00:00', '2010-01-01 19:00:00',
               '2010-01-01 20:00:00', '2010-01-01 21:00:00',
               '2010-01-01 22:00:00', '2010-01-01 23:00:00',
               '2010-01-02 00:00:00', '2010-01-02 01:00:00',
               '2010-01-02 02:00:00', '2010-01-02 03:00:00',
               '2010-01-02 04:00:00', '2010-01-02 05:00:00',
               '2010-01-02 06:00:00', '2010-01-02 07:00:00',
               '2010-01-02 08:00:00', '2010-01-02 09:00:00',
               '2010-01-02 10:00:00', '2010-01-02 11:00:00',
               '2010-01-02 12:00:00', '2010-01-02 13:00:00',
               '2010-01-02 14:00:00', '2010-01-02 15:00:00',
               '2010-01-02 16:00:00', '2010-01-02 17:00:00',
               '2010-01-02 18:00:00', '2010-01-02 19:00:00',
               '2010-01-02 20:00:00', '2010-01-02 21:00:00',
               '2010-01-02 22:00:00', '2010-01-02 23:00:00',
               '2010-01-03 00:00:00', '2010-01-03 01:00:00',
               '2010-01-03 02:00:00', '2010-01-03 03:00:00',
               '2010-01-03 04:00:00', '2010-01-03 05:00:00',
               '2010-01-03 06:00:00', '2010-01-03 07:00:00',
               '2010-01-03 08:00:00', '2010-01-03 09:00:00',
               '2010-01-03 10:00:00', '2010-01-03 11:00:00'],
              dtype='datetime64[ns]', freq='H')

In [161]:
pd.date_range('2010-01-01',periods=60,freq='W-MON')

DatetimeIndex(['2010-01-04', '2010-01-11', '2010-01-18', '2010-01-25',
               '2010-02-01', '2010-02-08', '2010-02-15', '2010-02-22',
               '2010-03-01', '2010-03-08', '2010-03-15', '2010-03-22',
               '2010-03-29', '2010-04-05', '2010-04-12', '2010-04-19',
               '2010-04-26', '2010-05-03', '2010-05-10', '2010-05-17',
               '2010-05-24', '2010-05-31', '2010-06-07', '2010-06-14',
               '2010-06-21', '2010-06-28', '2010-07-05', '2010-07-12',
               '2010-07-19', '2010-07-26', '2010-08-02', '2010-08-09',
               '2010-08-16', '2010-08-23', '2010-08-30', '2010-09-06',
               '2010-09-13', '2010-09-20', '2010-09-27', '2010-10-04',
               '2010-10-11', '2010-10-18', '2010-10-25', '2010-11-01',
               '2010-11-08', '2010-11-15', '2010-11-22', '2010-11-29',
               '2010-12-06', '2010-12-13', '2010-12-20', '2010-12-27',
               '2011-01-03', '2011-01-10', '2011-01-17', '2011-01-24',
               '2011-01-31', '2011-02-07', '2011-02-14', '2011-02-21'],
              dtype='datetime64[ns]', freq='W-MON')

In [162]:
pd.date_range('2010-01-01',periods=60,freq='B')

DatetimeIndex(['2010-01-01', '2010-01-04', '2010-01-05', '2010-01-06',
               '2010-01-07', '2010-01-08', '2010-01-11', '2010-01-12',
               '2010-01-13', '2010-01-14', '2010-01-15', '2010-01-18',
               '2010-01-19', '2010-01-20', '2010-01-21', '2010-01-22',
               '2010-01-25', '2010-01-26', '2010-01-27', '2010-01-28',
               '2010-01-29', '2010-02-01', '2010-02-02', '2010-02-03',
               '2010-02-04', '2010-02-05', '2010-02-08', '2010-02-09',
               '2010-02-10', '2010-02-11', '2010-02-12', '2010-02-15',
               '2010-02-16', '2010-02-17', '2010-02-18', '2010-02-19',
               '2010-02-22', '2010-02-23', '2010-02-24', '2010-02-25',
               '2010-02-26', '2010-03-01', '2010-03-02', '2010-03-03',
               '2010-03-04', '2010-03-05', '2010-03-08', '2010-03-09',
               '2010-03-10', '2010-03-11', '2010-03-12', '2010-03-15',
               '2010-03-16', '2010-03-17', '2010-03-18', '2010-03-19',
               '2010-03-22', '2010-03-23', '2010-03-24', '2010-03-25'],
              dtype='datetime64[ns]', freq='B')

In [163]:
dt = _

In [164]:
dt[0]

Timestamp('2010-01-01 00:00:00', freq='B')

In [168]:
dt[0].?

SyntaxError: invalid syntax (<ipython-input-168-8970f5d411d7>, line 1)

In [170]:
dt[0].to_pydatetime()

datetime.datetime(2010, 1, 1, 0, 0)

In [172]:
pd.date_range('2010-01-01',periods=60,freq='1h20min')

DatetimeIndex(['2010-01-01 00:00:00', '2010-01-01 01:20:00',
               '2010-01-01 02:40:00', '2010-01-01 04:00:00',
               '2010-01-01 05:20:00', '2010-01-01 06:40:00',
               '2010-01-01 08:00:00', '2010-01-01 09:20:00',
               '2010-01-01 10:40:00', '2010-01-01 12:00:00',
               '2010-01-01 13:20:00', '2010-01-01 14:40:00',
               '2010-01-01 16:00:00', '2010-01-01 17:20:00',
               '2010-01-01 18:40:00', '2010-01-01 20:00:00',
               '2010-01-01 21:20:00', '2010-01-01 22:40:00',
               '2010-01-02 00:00:00', '2010-01-02 01:20:00',
               '2010-01-02 02:40:00', '2010-01-02 04:00:00',
               '2010-01-02 05:20:00', '2010-01-02 06:40:00',
               '2010-01-02 08:00:00', '2010-01-02 09:20:00',
               '2010-01-02 10:40:00', '2010-01-02 12:00:00',
               '2010-01-02 13:20:00', '2010-01-02 14:40:00',
               '2010-01-02 16:00:00', '2010-01-02 17:20:00',
               '2010-01-02 18:40:00', '2010-01-02 20:00:00',
               '2010-01-02 21:20:00', '2010-01-02 22:40:00',
               '2010-01-03 00:00:00', '2010-01-03 01:20:00',
               '2010-01-03 02:40:00', '2010-01-03 04:00:00',
               '2010-01-03 05:20:00', '2010-01-03 06:40:00',
               '2010-01-03 08:00:00', '2010-01-03 09:20:00',
               '2010-01-03 10:40:00', '2010-01-03 12:00:00',
               '2010-01-03 13:20:00', '2010-01-03 14:40:00',
               '2010-01-03 16:00:00', '2010-01-03 17:20:00',
               '2010-01-03 18:40:00', '2010-01-03 20:00:00',
               '2010-01-03 21:20:00', '2010-01-03 22:40:00',
               '2010-01-04 00:00:00', '2010-01-04 01:20:00',
               '2010-01-04 02:40:00', '2010-01-04 04:00:00',
               '2010-01-04 05:20:00', '2010-01-04 06:40:00'],
              dtype='datetime64[ns]', freq='80T')

In [173]:
pd.date_range('2010-01-01','2010-06-01')

DatetimeIndex(['2010-01-01', '2010-01-02', '2010-01-03', '2010-01-04',
               '2010-01-05', '2010-01-06', '2010-01-07', '2010-01-08',
               '2010-01-09', '2010-01-10',
               ...
               '2010-05-23', '2010-05-24', '2010-05-25', '2010-05-26',
               '2010-05-27', '2010-05-28', '2010-05-29', '2010-05-30',
               '2010-05-31', '2010-06-01'],
              dtype='datetime64[ns]', length=152, freq='D')

In [174]:
sr = pd.Series(np.arange(100),index=pd.date_range('2017-01-01',periods=100))

In [175]:
sr

2017-01-01     0
2017-01-02     1
2017-01-03     2
2017-01-04     3
2017-01-05     4
              ..
2017-04-06    95
2017-04-07    96
2017-04-08    97
2017-04-09    98
2017-04-10    99
Freq: D, Length: 100, dtype: int32

In [176]:
sr.index

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07', '2017-01-08',
               '2017-01-09', '2017-01-10', '2017-01-11', '2017-01-12',
               '2017-01-13', '2017-01-14', '2017-01-15', '2017-01-16',
               '2017-01-17', '2017-01-18', '2017-01-19', '2017-01-20',
               '2017-01-21', '2017-01-22', '2017-01-23', '2017-01-24',
               '2017-01-25', '2017-01-26', '2017-01-27', '2017-01-28',
               '2017-01-29', '2017-01-30', '2017-01-31', '2017-02-01',
               '2017-02-02', '2017-02-03', '2017-02-04', '2017-02-05',
               '2017-02-06', '2017-02-07', '2017-02-08', '2017-02-09',
               '2017-02-10', '2017-02-11', '2017-02-12', '2017-02-13',
               '2017-02-14', '2017-02-15', '2017-02-16', '2017-02-17',
               '2017-02-18', '2017-02-19', '2017-02-20', '2017-02-21',
               '2017-02-22', '2017-02-23', '2017-02-24', '2017-02-25',
               '2017-02-26', '2017-02-27', '2017-02-28', '2017-03-01',
               '2017-03-02', '2017-03-03', '2017-03-04', '2017-03-05',
               '2017-03-06', '2017-03-07', '2017-03-08', '2017-03-09',
               '2017-03-10', '2017-03-11', '2017-03-12', '2017-03-13',
               '2017-03-14', '2017-03-15', '2017-03-16', '2017-03-17',
               '2017-03-18', '2017-03-19', '2017-03-20', '2017-03-21',
               '2017-03-22', '2017-03-23', '2017-03-24', '2017-03-25',
               '2017-03-26', '2017-03-27', '2017-03-28', '2017-03-29',
               '2017-03-30', '2017-03-31', '2017-04-01', '2017-04-02',
               '2017-04-03', '2017-04-04', '2017-04-05', '2017-04-06',
               '2017-04-07', '2017-04-08', '2017-04-09', '2017-04-10'],
              dtype='datetime64[ns]', freq='D')

In [177]:
sr['2017-03']

2017-03-01    59
2017-03-02    60
2017-03-03    61
2017-03-04    62
2017-03-05    63
2017-03-06    64
2017-03-07    65
2017-03-08    66
2017-03-09    67
2017-03-10    68
2017-03-11    69
2017-03-12    70
2017-03-13    71
2017-03-14    72
2017-03-15    73
2017-03-16    74
2017-03-17    75
2017-03-18    76
2017-03-19    77
2017-03-20    78
2017-03-21    79
2017-03-22    80
2017-03-23    81
2017-03-24    82
2017-03-25    83
2017-03-26    84
2017-03-27    85
2017-03-28    86
2017-03-29    87
2017-03-30    88
2017-03-31    89
Freq: D, dtype: int32

In [178]:
df

   two  one
c  NaN  NaN
d  NaN  5.0
b  3.0  6.0
a  4.0  7.0

In [179]:
sr

2017-01-01     0
2017-01-02     1
2017-01-03     2
2017-01-04     3
2017-01-05     4
              ..
2017-04-06    95
2017-04-07    96
2017-04-08    97
2017-04-09    98
2017-04-10    99
Freq: D, Length: 100, dtype: int32

In [184]:
sr['2017-04']

2017-04-01     90
2017-04-02     91
2017-04-03     92
2017-04-04     93
2017-04-05     94
2017-04-06     95
2017-04-07     96
2017-04-08     97
2017-04-09     98
2017-04-10     99
2017-04-11    100
2017-04-12    101
2017-04-13    102
2017-04-14    103
2017-04-15    104
2017-04-16    105
2017-04-17    106
2017-04-18    107
2017-04-19    108
2017-04-20    109
2017-04-21    110
2017-04-22    111
2017-04-23    112
2017-04-24    113
2017-04-25    114
2017-04-26    115
2017-04-27    116
2017-04-28    117
2017-04-29    118
2017-04-30    119
Freq: D, dtype: int32

In [181]:
sr['2017']

2017-01-01     0
2017-01-02     1
2017-01-03     2
2017-01-04     3
2017-01-05     4
              ..
2017-04-06    95
2017-04-07    96
2017-04-08    97
2017-04-09    98
2017-04-10    99
Freq: D, Length: 100, dtype: int32

In [183]:
sr = pd.Series(np.arange(1000),index=pd.date_range('2017-01-01',periods=1000))

In [185]:
sr

2017-01-01      0
2017-01-02      1
2017-01-03      2
2017-01-04      3
2017-01-05      4
             ...
2019-09-23    995
2019-09-24    996
2019-09-25    997
2019-09-26    998
2019-09-27    999
Freq: D, Length: 1000, dtype: int32

In [186]:
sr['2017']

2017-01-01      0
2017-01-02      1
2017-01-03      2
2017-01-04      3
2017-01-05      4
             ...
2017-12-27    360
2017-12-28    361
2017-12-29    362
2017-12-30    363
2017-12-31    364
Freq: D, Length: 365, dtype: int32

In [187]:
sr['2017':'2018-03']

2017-01-01      0
2017-01-02      1
2017-01-03      2
2017-01-04      3
2017-01-05      4
             ...
2018-03-27    450
2018-03-28    451
2018-03-29    452
2018-03-30    453
2018-03-31    454
Freq: D, Length: 455, dtype: int32

In [188]:
sr['2017-12-25':'2018-02-01']

2017-12-25    358
2017-12-26    359
2017-12-27    360
2017-12-28    361
2017-12-29    362
2017-12-30    363
2017-12-31    364
2018-01-01    365
2018-01-02    366
2018-01-03    367
2018-01-04    368
2018-01-05    369
2018-01-06    370
2018-01-07    371
2018-01-08    372
2018-01-09    373
2018-01-10    374
2018-01-11    375
2018-01-12    376
2018-01-13    377
2018-01-14    378
2018-01-15    379
2018-01-16    380
2018-01-17    381
2018-01-18    382
2018-01-19    383
2018-01-20    384
2018-01-21    385
2018-01-22    386
2018-01-23    387
2018-01-24    388
2018-01-25    389
2018-01-26    390
2018-01-27    391
2018-01-28    392
2018-01-29    393
2018-01-30    394
2018-01-31    395
2018-02-01    396
Freq: D, dtype: int32

In [190]:
sr.resample('W').sum()

2017-01-01       0
2017-01-08      28
2017-01-15      77
2017-01-22     126
2017-01-29     175
              ...
2019-09-01    6790
2019-09-08    6839
2019-09-15    6888
2019-09-22    6937
2019-09-29    4985
Freq: W-SUN, Length: 144, dtype: int32

In [191]:
sr.resample('M').sum()

2017-01-31      465
2017-02-28     1246
2017-03-31     2294
2017-04-30     3135
2017-05-31     4185
2017-06-30     4965
2017-07-31     6076
2017-08-31     7037
2017-09-30     7725
2017-10-31     8928
2017-11-30     9555
2017-12-31    10819
2018-01-31    11780
2018-02-28    11466
2018-03-31    13609
2018-04-30    14085
2018-05-31    15500
2018-06-30    15915
2018-07-31    17391
2018-08-31    18352
2018-09-30    18675
2018-10-31    20243
2018-11-30    20505
2018-12-31    22134
2019-01-31    23095
2019-02-28    21686
2019-03-31    24924
2019-04-30    25035
2019-05-31    26815
2019-06-30    26865
2019-07-31    28706
2019-08-31    29667
2019-09-30    26622
Freq: M, dtype: int32

In [192]:
df

   two  one
c  NaN  NaN
d  NaN  5.0
b  3.0  6.0
a  4.0  7.0

In [193]:
sr

2017-01-01      0
2017-01-02      1
2017-01-03      2
2017-01-04      3
2017-01-05      4
             ...
2019-09-23    995
2019-09-24    996
2019-09-25    997
2019-09-26    998
2019-09-27    999
Freq: D, Length: 1000, dtype: int32

In [194]:
sr.truncate(before='2018-02-03')

2018-02-03    398
2018-02-04    399
2018-02-05    400
2018-02-06    401
2018-02-07    402
             ...
2019-09-23    995
2019-09-24    996
2019-09-25    997
2019-09-26    998
2019-09-27    999
Freq: D, Length: 602, dtype: int32